//: Playground - noun: a place where people can play

import UIKit

print("Суть домашнего задания такова: \n\nЯ хочу, что бы вы создали тест. \n-Сколько угодно вопросов и вариантов ответа. \n-Вопросы должны быть пронумерованы, а варианты ответа пролитерованы(а, б, в). \n-Все это должно содержаться в коментариях. \n\nПосле этого я хочу видеть функцию с колличеством параметров, \nсоответствующих колличеству вопросов, и при вызове функции \nя введу буквы-варианты ответа в параметры. Функция должна \nвозвращать мою оценку по 100-бальной шкале.")
