//: Playground - noun: a place where people can play

import UIKit

//Базовые операторы:
//Унарные, ьинарные, тернарные!

//присваивания = 
//арифметические + - ; / %
//составные операторы присваивания += -= *= /=
//инкремент ++ декремент --
//унарный минус -
//сравнение == > < >= <= !=
//тернарный условный ? :
//диапазон ... ..<
//логические && || !

//арифмитические операторы

/*
var a = 10
var b = 5
a + b
a - b
a * b
a / b
a % b

var myNum = 45%7
*/

//составные операторы присваивания
/*
var a = 1
//a = a + 4
a += 4 //то же самое что и строчкой выше
*/

//инкремент и декремент
/*
var a = 5
a++
a
a--
a

var a = 5
++a
--a
*/

//унарный минус и плюс
/*
var a = 3
var b = -a
*/

//сравнения
2 == 1 // равняется ли два одному? нет
2 != 4 // не равняется ли 2 четырем? да, не равняется
4 > 3 // четыре больше трех? да
9 <= 7 // девять меньше либо равно семи? нет

// тернарный условный оператор

//условие?результат при true : результат при false

var isHot = false
isHot ? "Горяче" : "Не горяче"

//операторы диапазона
//... закрытый диапазон
//..< полуоткрытый 

//Логические операторы
//Не !
//И &&
//Или ||
/*
var a = true
var b = false

!a
!b
*/
/*
var a = true
var b = false
var c = true

a && b
a && c
*/

var a = true
var b = false
var c = false
a || b
a || c










